<?php
// +----------------------------------------------------------------------
// | Author:stark
// +----------------------------------------------------------------------
// | Date:	2023/02/11
// +----------------------------------------------------------------------
// | Desc:	Base 类
// +----------------------------------------------------------------------

class Message
{
    /** @var int 操作成功 */
    const CODE_SUCCESS = 200;
    /** @var int 服务器内部错误，无法完成请求 */
    const CODE_INTERNAL_SERVER_ERROR = 500;
    /** @var int 操作失败 */
    const CODE_FAIL = 4220;
    /** @var int 参数错误 */
    const CODE_PARAMETER_ERROR = 4204;
    /** @var int 缺少参数 */
    const CODE_MISSING_PARAMETER = 4203;
    /** @var int 拒绝访问 */
    const CODE_PERMISSION_DENIED = 7000;
    /** @var int 未验证IP */
    const CODE_UNVERIFIED_IP = 7050;
    /** @var int 未验证用户 */
    const CODE_UNVERIFIED_USER = 7051;
    /** @var int 系统繁忙 */
    const CODE_SYSTEM_BUSY = 4264;
    /** @var int 重复操作 */
    const CODE_REPEAT = 1027;
    /** @var int 重复操作 */
    const CODE_NO_LOGIN = 9996;
    /** @var int 拉黑 */
    const CODE_BLOCK = 20114;
    /** @var int 评论被拉黑 */
    const CODE_COMMENT_BLOCK_R = 20113;
    /** @var int 被拉黑 */
    const CODE_BLOCK_R = 20115;
    /** @var int 不允许登录 */
    const CODE_NOT_ALLOW_LOGIN = 10012;


    public static function getMessage($code, $module = 'common')
    {
        $messageList = self::$module();
        return $code == 200 ? $messageList[200] : ($messageList[$code] ?? "code 不存在") . " code:" . $code;
    }

    public static function common()
    {
        return [
            100 => '继续',
            200 => '操作成功',
            405 => "Method Not Allowed",
            404 => '资源不存在',
            500 => '服务器内部错误',

            1024 => '网站关闭',
            1025 => '资源关闭', // 降级 熔断
            1026 => '资源限流', // 限流
            1027 => '重复请求',
            2463 => '异常跳转', // 非前端返回


            4000 => 'Token验证失败',
            4101 => '处理数据失败',
            4201 => '请求校验失败',
            4202 => '网络错误',
            4203 => '缺少参数',
            4204 => '参数错误',
            4205 => '验证码错误',
            4206 => '注册失败',
            4207 => '验证码获取失败',
            4208 => '验证码获取频繁',
            4209 => '绑定失败',
            4210 => '未登录用户不能操作',
            4211 => '精华评论设置超出限制',
            4212 => '获取数据不存在',
            4218 => '提交数据错误',
            4220 => '操作失败',
            4221 => '苹果支付存在延迟，请稍后再试',
            4222 => '参数错误，请重新打开后再试',
            4223 => '字数超出限制',
            4224 => '充值暂时关闭，请移步网页吧',
            4225 => '劝你善良',
            4226 => '获取访问令牌失败',
            4227 => '刷新令牌已过期',
            4228 => '令牌请求频繁',

            4229 => '你已成功投诉过该内容，请勿重复投诉',
            4230 => '该手机号已经绑定微信，请换一个手机号再试',
            4231 => '该手机号已经绑定微博，请换一个手机号再试',
            4232 => '该手机号已经绑定QQ，请换一个手机号再试',
            4233 => '该手机号已经绑定邮箱，请换一个手机号再试',
            4234 => '该手机号异常，请换一个手机号再试',
            4235 => '网页不支持微信注册，请在app完成注册后才能在网页登录',
            4236 => '授权token过期，请重新登录',
            4237 => '已注册',
            4238 => '该账号没有绑定微信',
            4239 => '该账号没有绑定QQ',
            4240 => '该账号没有绑定微博',
            4241 => '该账号必须保留一种登录方式，不能解绑',
            4242 => '账号解绑失败',
            4243 => '该账号没有绑定邮箱',
            4244 => '该账号已经绑定微信',
            4245 => '该账号已经绑定微博',
            4246 => '该账号已经绑定QQ',
            4247 => '该微博已经绑定其他账号',
            4248 => '该微信已经绑定其他账号',
            4249 => '该QQ已经绑定其他账号',
            4250 => '该账号已经绑定邮箱，请升级至最新版本解绑原邮箱再进行绑定',
            4251 => '该账号已经绑定手机，请升级至最新版本换绑手机号',
            4252 => '网页端暂不支持微信第三方注册，如有需要，请去app端完成授权后再进行登录',
            4253 => '为了你的账户安全，请设置密码再完成解绑',
            4254 => '数据异常，请重新注册',
            4255 => '验证失败,请刷新页面再试',
            4256 => '书架文件夹创建超出限制，请解散文件夹才能创建',
            4257 => '书架文件夹小说数超出限制，请清除部分小说才能添加',
            4258 => '操作小说数超出限制，请减少小说分批操作',
            4259 => '请勿频繁操作',
            4260 => '邮箱注册已关闭，请使用手机号注册',
            4261 => '版本过低，暂停维护，请去商店下载最新版本',
            4262 => '苹果验证失败',
            4263 => '置顶评论设置超出限制',
            4264 => '系统繁忙，请稍后再试',

            4300 => '验证失败',
            4301 => "安全插件未注册",
            4302 => "禁言中，如有疑问请联系客服",
            4303 => "账号存在风险，禁止发言，如有疑问请联系客服",
            4304 => "昵称违规，请更改",
            4305 => "用户签名违规，请更改",
            4306 => "作者昵称违规，请更改",
            4307 => "作者简介或公告违规，请更改",
            4308 => "书单名称或一句话简介违规，请更改",
            4309 => "书单描述违规，请更改",
            4310 => "作品标题或小灰字违规，请更改",
            4311 => "作品文案违规，请更改",
            4312 => "作品分卷违规，请更改",
            4313 => "章节标题违规，请更改",
            4314 => "章节内容违规，请更改",
            4315 => "当前等级不支持书单发布",
            4316 => "未绑定手机不支持书单发布",
            4317 => "当前等级书单发布已达上限",
            4318 => "关注作者已达上限",
            4319 => "收藏作品已达上限",
            4320 => "请先绑定手机号",
            4321 => "请求小说本数过多",

            4330 => "标签违规，请更改",

            4999 => "滑动验证码校验失败",
            // 小说
            5000 => '小说不存在',
            5001 => '章节不存在',
            5002 => '当前你只能评论5条',
            5003 => '今天评论已超限制，不能再评论了',
            5004 => '长评字数最少500字',
            5005 => '评论字数超过500字',
            5006 => '未绑定手机号不能发表评论',
            5007 => '长评不能超过3000字',
            5008 => '标题字不能超过20字',
            5009 => '亲爱的鱼宝，订阅之后就可以跟小伙伴愉快讨论啦！',
            5010 => '发送评论过于频繁，间隔不应小于5秒，请稍后再试',
            5011 => '章节已被冻结',
            5012 => '小说已被锁定',
            5013 => '小说已被冻结',
            5014 => '被锁定或冻结章节不能订阅',
            5015 => '请勿重复发布作品',
            5016 => '由于系统升级，订阅会暂时关闭，预计30分钟后打开,对你造成不便深感抱歉',
            5017 => '该作品已经申请过本期福利了',
            5018 => '作品创建时间不在福利期内',
            5019 => '该作品已经申请过此福利了',
            5020 => '字数不满足申榜条件',
            5021 => '您已提交过申请',
            5022 => '申请失败，如有疑问请联系客服',
            5023 => '请填写入V章节序号',
            5024 => '请填写入V当天预计更新字数',
            5025 => '请填写入V当天预计更新章节数',
            5026 => '请填写预计全文字数',
            5027 => '请填写非V字数',
            5028 => '请选择入V时间',
            5029 => '非签约作者无法申请入V',
            5030 => '小说字数不满足入V要求',
            5031 => '该小说已经是V文了',
            5032 => '该小说已提交入V申请',

            5033 => '技术升级，小说创建暂时关闭',
            5034 => '小说已被锁定或冻结',
            5035 => '更多评论请在章节中查看',

            5100 => "前方人有点多，发文再等一等",
            5101 => "今日发布小说过多，请明日再试【新注册用户两个小时后才可以发更多小说哦～】",

            // 账户
            6000 => '您的玉佩不足',
            6001 => '当前账号无法打赏评论本章',
            6002 => '您还未订阅本章，无法打赏评论',
            6003 => '您已订阅',

            6004 => '前方拥挤，请稍后再试',
            6005 => '订阅玉佩发生变动',

            // 后台
            7000 => '无访问权限',
            7001 => '未设置权限',
            7003 => '密码只能为包含字母、数字的6-16个字符',
            7004 => '账号已被使用',
            7005 => '请输入密码',
            7006 => '该签约等级下含有签约作者，请先解约',
            7007 => '该分类存在子分类，无法删除',
            7008 => '该分类下存在小说，无法删除',
            7009 => '该标签下存在小说，无法删除',

            7050 => '未验证IP',
            7051 => '未验证用户',

            8000 => '您已添加收藏',
            8001 => '您未添加收藏',

            9000 => '您还不是作者，请先申请成为作者',
            9001 => "签约作者不能申请删除作品",
            9002 => '您本月已申请过提现了！',
            // 作者申签
            9003 => "请填写联系QQ",
            9004 => "请选择1~3部作品",
            9005 => "自荐字数在200字以内",

            9900 => '签约作者不能注销账号',
            9901 => '需绑定手机号才能注销',
            9902 => '该手机号由于注销次数过多，不能使用',
            9903 => '手机号异常，不能使用',
            9904 => '账号不存在',
            9905 => '验证码已失效，请重新发送',

            9963 => '仅能补签最近30天的哦',
            9964 => '此道具每次只能购买一件',
            9965 => '此道具只需购买一次，不必重复购买',
            9966 => '本月不可购买补签卡啦',
            9967 => '海星不够啦，去做成就赚海星吧',
            9968 => '该商品不能购买',
            9969 => '你没有补签卡了呢',
            9970 => '暂未开启补签功能',
            9971 => '您已签到',
            9972 => '签到失败',
            9973 => '该小说已经申请过榜单了',
            9974 => '笔名不可用或已被使用',
            9975 => '你已经是作者了',
            9976 => "签约作者不能修改笔名",
            9977 => "笔名修改次数已达上限",

            9980 => '密码只能为包含字母、数字的6-16个字符',
            9981 => '该名称不符合规则或已被占用',
            9982 => '注册失败',
            9983 => '手机号格式错误',
            9984 => '手机地址错误，请输入正确手机地址',
            9985 => '手机不存在',
            9986 => '邮箱不存在',
            9990 => '账号审核中，请稍后再试',
            9991 => '账号已被封禁',
            9992 => '该手机号已注册过了',
            9993 => '邮箱地址错误，请输入正确邮箱地址，仅支持qq、163、gmail等常用邮箱',
            9994 => '该邮箱已注册过了',
            9995 => '账号或密码错误，请重新输入',
            9996 => '请先登录',
            9997 => '该账号在其他设备登录，请重新登录',
            9998 => 'loginToken已过期,请重新获取',
            9999 => '登录过期,请重新登录',
            10000 => 'swoole connect failed',
            10001 => 'swoole send failed',
            10002 => 'swoole recv failed',
            10003 => '调用的类不存在',
            10004 => '调用的方法不存在',
            10005 => 'swoole 繁忙',
            10006 => 'swoole 数据格式错误',
            10007 => 'mongodb swoole 请求异常',
            10008 => 'mongodb swoole 请求超时',
            10009 => 'swoole查询失败',

            10010 => '申请审核中',
            10011 => '申请审核不通过',
            10012 => '此账号无法登录',
            10013 => '此手机号无法绑定第三方账号',

            20001 => "用户登录失败",
            20002 => "获取小程序信息失败",
            20003 => "小程序用户数据校验失败",
            20004 => "open鉴权失败",
            20005 => "ip限制",

            20006 => "登录成功", // 登录成功但是需要短信（邮件）验证
            20100 => "禁止投诉",
            20101 => "投诉已达上限",
            20102 => "投诉成功，系统检测到您投诉过多正常内容，若继续进行恶意投诉，系统将禁止您使用投诉功能！",
            20103 => "投诉成功，系统检测到您投诉过多正常内容，若继续进行恶意投诉，系统将封禁您的账号！",
            20104 => "您已经投诉过了",
            20105 => "今日投诉已达上限",
            20106 => "版本不存在或已丢失，无法还原",
            20107 => "配置未初始化，请先初始化配置",
            20108 => "暂时关闭评论和打赏功能",
            20109 => '不符合抽奖规则',
            20110 => '不能重复抽奖',
            20111 => '位置参数不能为空',
            20112 => '位置参数最小为1，最大为9',
            20113 => '由于用户设置问题，您无法对此动态进行评论',
            20114 => '请先将该用户从黑名单移出后再操作',
            20115 => '由于用户设置问题，您无法进行此操作',

            // open系列接口msg
            50001 => "请求过期",
            50002 => "校验token为空",
            50003 => "token校验失败",
            50004 => "小说不存在",
            50005 => "作者不存在",
            50006 => "动态内容不能为空",
        ];
    }
}
